# Evaluation config config for training an animal and person detector using the eMammal dataset

# This config file is based on
# https://github.com/tensorflow/models/blob/master/research/object_detection/samples/configs/ssdlite_mobilenet_v2_coco.config
# SSDLite with Mobilenet v2 configuration for MSCOCO Dataset.


eval_config: {
  num_examples: 5239
  num_visualizations: 400
  max_evals: 1
#  visualization_export_dir: "/yasiyu/experiments/ssdlite_mobilenetv2_coco_weights_loc/val_viz"
#  keep_image_id_for_visualization_export: true
  max_num_boxes_to_visualize: 100
  visualize_groundtruth_boxes: true
  groundtruth_box_visualization_color: "white"
  metrics_set: "coco_detection_metrics"
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/yasiyu/mnt/emammaltrain/local_tf20180929/val-?????-of-00030"
  }
  label_map_path: "/yasiyu/mnt/emammaltrain/afs_batchai/animal_person_detector/detector_label_map.pbtxt"
  shuffle: false
  num_readers: 1
}

model {
  ssd {
    num_classes: 2
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 600
        width: 600
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        use_depthwise: true
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'
      min_depth: 16
      depth_multiplier: 1.0
      use_depthwise: true
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        weighted_sigmoid {
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      hard_example_miner {
        num_hard_examples: 64
        iou_threshold: 0.99
        loss_type: BOTH
        max_negatives_per_positive: 3
        min_negatives_per_image: 0
      }
      classification_weight: 20.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

# new model_main.py seems to require train_config.optimizer for evaluation job too

#train_config: {
#  optimizer {
#    momentum_optimizer {
#      learning_rate {
#        manual_step_learning_rate {
#          initial_learning_rate: 0.0003
#          schedule {
#            step: 900000
#            learning_rate: 0.00003
#          }
#          schedule {
#            step: 1200000
#            learning_rate: 0.000003
#          }
#        }
#      }
#      momentum_optimizer_value: 0.899999976158
#    }
#    use_moving_average: false
#  }
#}